def area(a, b):
    '''Возвращает площадь прямоугольника
    
            Параметры:
                    a (float): Сторона a прямоугольника
                    b (float): Сторона b прямоугольника
            
            Возвращаемое значение:
                    square (float): Площадь прямоугольника со сторонами a и b'''
    return a * b 

def perimeter(a, b): 
    ''' Возвращает периметер прямоугольника
    
            Параметры:
                    a (float): Сторона a прямоугольника
                    b (float): Сторона b прямоугольника
                    
            Возвращаемое значение:
                    perimeter (float): Периметер прямоугольника со сторонами a и b'''
    return 2 * (a + b) 
