def area(a):
    '''Возвращает площадь квадрата
    
            Параметры:
                    a (float): Сторона квадрата
            
            Возвращаемое значение:
                    square (float): Площадь квадрата со стороной a'''
    return a * a


def perimeter(a):
    '''Возвращает периметер квадрата
            
            Параметры:
                    a (float): Сторона квадрата
            
            Возвращаемое значение:
                    perimeter (float): Периметер квадрата со стороной a'''
    return 4 * a
z``